Revit 2027 API
BuiltInFailures.CurtainGridFamilyFailures.InvalidCurtainPanelInModel Property
 There is an invalid Curtain Panel in the model. This is probably caused by two Grid Lines almost meeting at a border of the Curtain Wall or Sloped Glazing, but not exactly at a point. The Curtain Panel can't be displayed.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId InvalidCurtainPanelInModel { get; }
Public Shared ReadOnly Property InvalidCurtainPanelInModel As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ InvalidCurtainPanelInModel {
	FailureDefinitionId^ get ();
}
static member InvalidCurtainPanelInModel : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.CurtainGridFamilyFailures Class
Autodesk.Revit.DB Namespace